load_test/test_challenge1_results.txt
(oneapi) $ k6 run test_challenge1.js

          /\      |‾‾| /‾‾/   /‾‾/
     /\  /  \     |  |/  /   /  /
    /  \/    \    |     (   /   ‾‾\
   /          \   |  |\  \ |  (‾)  |
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: test_challenge1.js
     output: -

  scenarios: (100.00%) 1 scenario, 20 max VUs, 1m30s max duration (incl. graceful stop):
           * default: 20 looping VUs for 1m0s (gracefulStop: 30s)


running (1m00.2s), 00/20 VUs, 1200 complete and 0 interrupted iterations
default ✓ [======================================] 20 VUs  1m0s

     data_received..................: 235 kB 3.9 kB/s
     data_sent......................: 589 kB 9.8 kB/s
     http_req_blocked...............: avg=138.47µs min=51.2µs  med=124.35µs max=790.6µs p(90)=207.53µs p(95)=236.34µs
     http_req_connecting............: avg=84.94µs  min=17.7µs  med=77.04µs  max=605.3µs p(90)=137.61µs p(95)=162.84µs
     http_req_duration..............: avg=2.61ms   min=971.2µs med=1.75ms   max=32.4ms  p(90)=3.35ms   p(95)=6.14ms
       { expected_response:true }...: avg=2.61ms   min=971.2µs med=1.75ms   max=32.4ms  p(90)=3.35ms   p(95)=6.14ms
     http_req_failed................: 0.00%  ✓ 0         ✗ 1200
     http_req_receiving.............: avg=72.98µs  min=18.4µs  med=64.6µs   max=707µs   p(90)=110.92µs p(95)=130.2µs
     http_req_sending...............: avg=49.01µs  min=18.59µs med=40.65µs  max=996µs   p(90)=68.4µs   p(95)=87.3µs
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s       max=0s      p(90)=0s       p(95)=0s
     http_req_waiting...............: avg=2.49ms   min=878.4µs med=1.64ms   max=32.28ms p(90)=3.16ms   p(95)=5.84ms
     http_reqs......................: 1200   19.928345/s
     iteration_duration.............: avg=1s       min=1s      med=1s       max=1.03s   p(90)=1s       p(95)=1s
     iterations.....................: 1200   19.928345/s
     vus............................: 20     min=20      max=20
     vus_max........................: 20     min=20      max=20